# St7GetNumInfluenceVariables

Returns the number of load influence variables available in the current result file.

long St7GetNumInfluenceVariables(long uID, long* NumVariables)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumVariables
Number of available load influence variables.